{
    "result": [
      {
        "Foto": "https://drive.google.com/file/d/1wLuNU99ETK8EhRuuox-8BK00uas7pxi0/view?usp=drive_link",
        "Waktu" : "30 Menit",
        "Kalori" : "350 kalori",
        "Nama Makanan": "Ayam Geprek",
        "Bahan": "Ayam bagian Dada\n2 Siung Bawang Putih\n5 Siung Bawang Merah\n6 Cabe Rawit\n4 Cabe Merah Kriting\n1 sdm Tepung Tapioka\n250 gr Tepung terigu\nGaram, Gula, dan Penyedap rasa",
        "Langkah": "1. Buatlah adonan kering dan adonan basah dari tepung tapioka dan tepung terigu, tambahkan garam, gula, dan penyedap rasa sesuai selera.\n2. Masukkan seluruh potongan ayam yang sudah diungkep secara satu persatu ke dalam adonan kering, lalu ke adonan basah, lalu ke adonan kering lagi agar menjadi crispy saat digoreng nanti.\n3. Panaskan minyak, goreng ayam hingga matang dan berwarna kuning kecoklatan. Angkat, tiriskan.\n4. Selanjutnya rebus semua bahan sambal yaitu cabai rawit, cabai merah kriting, bawang putih, dan bawang merah selama 3 menit. Angkat, tiriskan.\n5. Lalu tumbuk semua bahan sambal, tambahkan garam, gula, dan penyedap rasa sesuai selera.\n6. Letakkan ayam goreng di cobek, lalu digeprek. Sajikan ayam geprek beserta sambalnya."
      },
      {
        "Foto": "https://drive.google.com/file/d/1wLZ8Fif08U5R4m15O0FNIxTrwyaWiQkU/view?usp=drive_link",
        "Waktu" : "45 Menit",
        "Kalori" : "300 kalori",
        "Nama Makanan": "Soto Banjar",
        "Bahan": "450g fillet dada ayam tanpa kulit\n1L air\n3 butir kapulaga\n2 butir pekak\n2 butir cengkih\n2 buah biji pala, belah\n1 batang kayu manis ukuran sedang\n2 sdt Royco Kaldu Ayam\nBumbu halus:\n10 butir bawang merah\n6 siung bawang putih\n3 butir kemiri, sangrai\n1 cm kunyit\n½ sdt garam\n½ sdt merica putih bubuk\n2 sdm minyak, untuk menumis\nPelengkap:\n125g suun, rebus\n4 buah ketupat siap santap, potong-potong\n2 butir telur ayam, rebus, belah dua\n4 buah perkedel kentang siap santap\n2 batang daun seledri, iris tipis bawang merah goreng\n1 buah jeruk nipis, potong",
        "Langkah": "1. Rebus dada ayam hingga matang dan empuk. Angkat dada ayam, suwir, sisihkan. Sisihkan air rebusannya.  Menumis rempah untuk Soto Banjar.\n2 Tumis bumbu halus, kapulaga, pekak, cengkih, biji pala, dan kayu manis hingga harum.  Membumbui Soto Banjar dengan Royco.\n3 Masukkan tumisan bumbu halus ke dalam air rebusan dada ayam. Rebus kembali, aduk rata. Tambahkan Royco Kaldu Ayam, aduk rata.\n4. Di dalam mangkuk, tata ketupat, suun, perkedel kentang, telur ayam rebus, dan suwiran dada ayam.\n5. Tuangkan kuah soto ke dalam mangkuk. Sajikan bersama taburan bawang merah goreng serta jeruk nipis."
      },
      {
        "Foto": "https://drive.google.com/file/d/1wOkr0teLpCwMeL_WRBvGBxxxJqs3I00F/view?usp=drive_link",
        "Waktu" : "40 Menit",
        "Kalori" : "250 kalori",
        "Nama Makanan": "Laksa",
        "Bahan": "3 sdm minyak goreng\n30 g ebi, rendam air panas, haluskan, sangrai kering\n15 butir bawang merah, iris halus\n3 batang serai, ambil bagian putih, memarkan\n2 L santan sedang\n1 sdt kaldu ayam bubuk\n2 sdt garam\nBumbu, haluskan:\n8 siung bawang putih\n4 buah cabai merah besar\n5 cm temu mangga\n3 cm jahe\n2 cm kunyit, bakar\n1 sdt ketumbar, sangrai\n1 sdt merica putih butiran, sangrai\n12 sdt jintan, sangrai\n1 sdt terasi bakar\n100 ml air\nIsi:\n6 buah ketupat, potong potong\n250 g udang, kupas\n250 g dada ayam, rebus, suwir-suwir halus\n1 buah tahu putih, potong dadu 2 cm, goreng tidak kering\n4 butir telur ayam, rebus, belah 2\nPelengkap:\nBihun, seduh\nTaoge\nJeruk nipis\nKemangi\nBawang goreng\nEmping\nSambal rebus",
        "Langkah": "1. Panaskan minyak dalam panci. Tumis ebi, bawang merah, serai, dan terasi hingga harum.\n2. Masukkan bumbu halus, tumis hingga bumbu matang dan harum.\n3. Tuang santan, kaldu ayam bubuk, dan garam kecilkan api. Masak sambil ditimba-timba hingga mendidih, agar santan tidak pecah. Angkat.\n4. Tata isi dalam mangkuk saji, tuangi kuah santan. Sajikan panas dengan pelengkap."
      },
      {
        "Foto":"https://drive.google.com/file/d/1wNP15_8YHlf42J2ZBOzG9Knm2whF6qrV/view?usp=drive_link",
        "Nama Makanan": "Rendang Daging Sapi",
        "Waktu" : "60 Menit",
        "Kalori" : "200 kalori",
        "Bahan": "1 kg daging tanpa urat, potong dadu 4 cm\n2,5 L santan dari 3 butir kelapa\n5 batang serai, memarkan 1 lembar daun kunyit, ikat simpul 15 lembar daun jeruk\n2 potong asam kandis\nBumbu, haluskan:\n250 g cabai merah keriting\n200 g bawang merah\n7 siung bawang putih\n3 cm jahe\n3 cm lengkuas\n7 sdm garam",
        "Langkah": "1. Masukkan daging ke dalam wajan berdasar tebal. Tambahkan bumbu halus, santan, serai, daun kunyit, dan daun jeruk, masak di atas api sedang sambil diaduk hingga mendidih.\n2. Kecilkan api, masak terus hingga santan mengental. Aduk sesekali agar bumbu tidak gosong.\n3. Tambahkan asam kandis, teruskan memasak hingga daging agak berwarna kehitaman, dan santan berminyak. Angkat, sajikan hangat"
      },
      {
        "Foto": "https://i.postimg.cc/VsCF87k7/Sapo-Tahu.png",
        "Nama Makanan": "Sapo Tahu",
        "Waktu" : "20 Menit",
        "Kalori" : "200 kalori",
        "Bahan": "120 g udang\n120 g cumi\nGaram secukupnya\nMerica secukupnya\nKaldu jamur secukupnya\n4 siung bawang putih\n60 g bawang bombay\n10 g jahe\n80 g wortel\n100 g brokoli\n80 g pakcoy\n420 g tahu jepang\n2 sdm kecap asin\nSlurry (2 sdm maizena + 80 ml air)",
        "Langkah": "1. Siapkan sayuran yang digunakan dengan cara dibersihkan lalu direbus sampai setengah matang.\n2. Potong bawang bombay, cincang bawang putih, dan geprek jahe untuk bumbunya.\n3. Bersihkan cumi dan udang, lalu beri merica, garam, dan kaldu jamur.\n4. Potong tahu lalu dibalur dengan tepung maizena, diamkan 1-2 menit, lalu goreng dengan minyak panas.\n5. Tumis bawang putih, cumi dan udang sampai setengah matang.\n6. Tumis bumbu sampai wangi, lalu tambahkan sayuran, air dan seasoning. Tunggu sampai mendidih.\n7. Setelah mendidih tambahkan tahu, seafood dan slurry. Tunggu sampai mengental lalu tambahkan minyak wijen.\n8. Hidangan siap disajikan."
      },
      {
        "Foto": "https://i.postimg.cc/JnmXm7Gq/Sup-Telur-Jagung.png",
        "Nama Makanan": "Sup Telur Jagung",
        "Waktu" : "30 Menit",
        "Kalori" : "350 kalori",
        "Bahan": "1 bagian Ayam bagian paha atau dada\n2 ltr Air\n2 batang daun bawang bagian putih\n1/2 buah bombay\nGaram secukupnya\n3 butir Telur\n1 buah Jagung madu\n100 g Wortel atau 1 buah\n1 sdt kecap asin\n1/2 sdt Lada\n1/2  sdt Gula\n1 sdt Minyak wijen\nSlurry (2 sdm Maizena+ 80 ml air)\nDaun bawang iris",
        "Langkah": "1. Rebus ayam dengan batang putih daun bawang, bombay, dan garam. Setelah mendidih, kecilkan api dan masak 30 mnt.\n2. Tiriskan ayam beserta bahan-bahan lainnya, dan rebus kembali air bekas rebusan sampai mendidih.\n3. Siapkan bahan pokok yaitu Potong kecil jagung, dan wortel. Kocok 3 buah telur. Suwir ayam hasil rebusan.\n4. Masukkan jagung, wortel, kecap asin, garam, lada, dan gula. Masak 3 mnt.\n5. Masukkan suwiran ayam dan telur sambil diaduk. Tambahkan Slurry dan minyak wijen.\n6. Hidangkan dengan potongan daun bawang."
      },
      {
        "Foto": "https://i.postimg.cc/W1kqkqZ8/Lasagna.png",
        "Nama Makanan": "Lasagna",
        "Waktu" : "45 Menit",
        "Kalori" : "500 kalori",
        "Bahan": "250 g daging cincang\n350 g keju cheddar\n7 lembar kulit lasagna\n'500 ml susu cair\n100 g keju parut\n1 sdt oregano kering\n4 siung bawang putih\n1 buah bawang bombay\n3 buah tomat merah\n3 sdm saus tomat\n4 sdm saus spaghetti\n'2 helai daun salam\n1/4 sdt kaldu bubuk\nGaram, gula & lada bubuk secukupnya",
        "Langkah": "1. Untuk saus tomat. Cuci bersih tomat, sayat sedikit di kulitnya lalu rebus hingga kulitnya terlihat mengelupas.\n2. Jika sudah agak dingin, kupas kulitnya lalu blender halus.\n3. Cincang bawang bombay dan bawang putih, tumis hingga matang. Masukkan daging cincang, tumis hingga daging matang.\n4. Tuang semua bahan saus tomat, masak hingga mengental dan warnanya merah pekat. Jika sudah enak, angkat.\n5. Untuk saus putih. Lelehkan mentega, masukkan tepung terigu, aduk rata hingga larut dan tidak ada yang menggumpal. Gunakan api kecil.\n6. Rebus pasta lasagna hingga cukup empuk. Tirikan.\n7. Panaskan oven dengan suhu 170 derajat Celcius. Siapkan loyang atau mangkuk tahan panas.\n8. Letakkan satu lembar lasagna di dasar. Tuang saus tomat. Tuang saus bechamel. Tabur keju cheddar secukupnya. Ulangi langkah yang sama hingga lembaran lasangna dan semua saus habis. Tutup dengan taburan keju cheddar\n. Panggang selama 20 menit atau permukaanya kuning keemasan. Siap disajikan."
      },
      {
        "Foto": "https://i.postimg.cc/mr4k1XBZ/Telur-Dadar-Padang.png",
        "Nama Makanan": "Telur Dadar Padang",
        "Waktu" : "20 Menit",
        "Kalori" : "250 kalori",
        "Bahan": "5 butir telur bebek\n8 butir bawang merah\n3 sdm tepung terigu\n3 batang seledri\n3 lembar daun jeruk\n1 batang daun bawang\n1 lembar daun kunyit\n2 sdt penyedap rasa\n1/2 sdt merica putih bubuk\n200 ml + 4 sdm minyak goreng\n3 buah cabai keriting\n2 buah cabai rawit\n1 buah tomat",
        "Langkah": "1. Blender cabai keriting, rawit, 3 bawang merah, tomat, dan 4 sdm minyak goreng hingga halus.\n2. Tumis hasil blenderan sampai harum. Jika sudah harum tiriskan.\n3. Campurkan bumbu halus, telur bebek, bawang merah, tepung terigu, seledri, daun jeruk, daun bawang, daun kunyit, penyedap rasa, dan merica di dalam mangkuk. Aduk rata\n4. Panaskan minyak. Jika sudah panas tuang bahan telur. Goreng telur hingga matang di kedua sisinya.\n5. Angkat dan hidangan siap disajikan"
      },
      {
        "Foto": "https://drive.google.com/file/d/1a_AzcVjCmmENZXfcY12wv7Qhnb2vZqaU/view?usp=drive_link",
        "Nama Makanan": "Nasi Goreng",
        "Waktu" : "15 Menit",
        "Kalori" : "400 kalori",
        "Bahan": "2 Porsi nasi\n2 Butir telur\nBakso ikan, udang dan ayam\n3 Siung bawang merah dan putih\nKecap asin dan manis\nSaus tiram\nGula dan penyedap",
        "Langkah": "1. Panaskan wok dengan api besar, tuang minyak lalu tumis ayam dan udang kemudian aduk dan masukkan bakso ikan masak sebentar lalu sisihkan\n2. Gunakan wok yang sama, gunakan api besar dan tuang minyak lalu orak-arik telur hingga kering dan minyak berbuih kemudian masukkan bawang merah dan bawang putih parut lalu tumis hingga wangi\n3. Masukkan kecap ikan, bakso ikan, udang, ayam, cabai, dan daun bawang lalu tumis sebentar\n4. Masukkan nasi, kecap asin, kecap manis, saus tiram, gula, merica, saus tiram, dan penyedap kemudian aduk hingga rata\n5. Masukkan daun bawang bagian hijau dan margarin, aduk rata lalu matikan api, nasi goreng siap disajikan"
      },
      {
        "Foto": "https://drive.google.com/file/d/1ftKkwQXfiai2n781oE1JwDZnZuQRIQcS/view?usp=drive_link",
        "Nama Makanan": "Pancake",
        "Waktu" : "20 Menit",
        "Kalori" : "450 kalori",
        "Bahan": "Tepung terigu 6 sdm\nBaking powder 1 sdt\nSusu cair 10 sdm\nGula pasir 3 sdm\nKecap asin dan manis\n1 butir telur\nMargarin 2 sdm",
        "Langkah": "1. Campur tepung dan baking powder, aduk rata. Sisihkan\n2. Di mangkuk terpisah, kocok telur dan gula. Lelehkan mentega dengan api kecil, lalu tambahkan kedalam susu. Tuang susu ke dalam adonan telur, aduk rata.\n3. Campurkan adonan basah ke dalam adonan kering secara bertahap. Aduk rata. Saring adonan supaya semakin halus. Biarkan adonan istirahat selama 15 menit.\n4. Panaskan teflon dengan api sedang. Masukan 50gr adonan pancake ke dalam teflon dan tunggu 2 - 3 menit, atau sampai bagian atas mulai kelihatan matang.\n5. Balik pancake, lalu masak selama 2 menit.  Keluarkan pancake dari teflon."
      },
      {
        "Foto": "https://drive.google.com/file/d/1kfwdmPGwEXqHNaEquBEwk_gADf-RrcSf/view?usp=drive_link",
        "Nama Makanan": "Donat Gula",
        "Waktu" : "50 Menit",
        "Kalori" : "200 kalori",
        "Bahan": "250 gr tepung terigu\n100 gr kentang halus\n35 gr gula pasir\n100 ml air / susu\n6 gr ragi\n1 butir kuning telur\n30 gr margarin cair\nBaking powder\nSusu bubuk",
        "Langkah": "1. Campur tepung terigu, ragi, gula, baking powder, dan susu bubuk aduk rata\n2. Tambahkan kentang yang sudah dihaluskan, aduk terus dengan sumpit hingga mirip gumpalan pasir.\n3. Campurkan kuning telur, air, dan margarin cair aduk rata.\n4. Campurkan bahan cair dan bahan kering, aduk. Simpan dalam wadah lalu tutupi dengan cling wrap diamkan 30 menit\n5. Uleni adonan sebentar lalu diamkan 5-10 menit, Olesi talenan dan rolling pin dengan sedikit minyak. Pipihkan adonan, lalu cetak dengan cetakan donat.\n6. Diamkan donat selama 20 menit atau sampai mengembang, Panaskan minyak, gunakan api kecil lalu goreng hingga kuning keemasan.\n7. Angkat donat. Gulingkan donat yang sudah dingin ke gula halus. Donat Kentang siap disajikan"
      },
      {
        "Foto": "https://drive.google.com/file/d/1CfP1A-Q1TxcKUhWYs5zkVXi0yZd4UkvB/view?usp=drive_link",
        "Nama Makanan": "French Toast",
        "Waktu" : "15 Menit",
        "Kalori" : "350 kalori",
        "Bahan": "3 lembar roti tawar\n170 ml susu\n3 butir telur\n¼ sdt garam\n1 sdt ekstrak vanila\nGula\nMargarin",
        "Langkah": "1. Campurkan telur, susu, garam, ekstrak vanilla, aduk lalu celupkan roti di kedua sisi.\n2. Panaskan wajan di api sedang, masukkan mentega lalu panggang roti masing-masing sisi selama 4 menit atau hingga kecokelatan.\n3. Taburkan gula di semua sisi dan terakhir masukkan mentega, sisihkan.\n4. French toast dengan buah-buahan siap disajikan "
      }
    ]
  }